Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.LoadType
The load type of analytical equipment load.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.TrueLoad
The electrical true load of analytical equipment load.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.PowerFactor
The power factor of analytical equipment load.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for power factor must be between 0 and 1.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.Current
The current of the analytical equipment load.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.Voltage
The voltage of the analytical equipment load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for voltage is not a number
-or-
When setting this property: The given value for voltage is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for voltage must be positive.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.ApparentLoad
The electrical apparent load of analytical equipment load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
-or-
When setting this property: The given value for value is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for value must be non-negative.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.LoadSet
The electrical analytical load set of the analytical equipment load.
Remarks:
invalidElementId if the analytical equipment load does not belong to any analytical load sets.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given element id loadSetId is neither a load set id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.LoadClassification
The load classification of analytical equipment load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a load classification id .
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData
Represents the data and parameters of point load node.
Since:
2023